thalman/c-aducid/src/aducid.c
#include "aducid.h"
#include "soap.h"
#include "aducidsoap.h"
#include "utils.h"
#include "attrlist.h"
#include "myxml.h"

#if defined _WIN32 || defined _WIN64
/* nothing special for windows */
#else
/* on linux we need */
#include <curl/curl.h>
#include <unistd.h>
#endif

#include "definitions.h"

DLL_PUBLIC
void aducid_free_aim_request_operation_response(AducidAIMRequestOperationResponse *response) {
    if( response == NULL ) { return; }
    safe_free(response->authId);
    safe_free(response->bindingId);
    safe_free(response->bindingKey);
    free(response);
}

DLL_PUBLIC
void aducid_free_aim_get_psl_attributes_response(AducidAIMGetPSLAttributesResponse *response) {
    if( response == NULL ) { return; }
    safe_free(response->userDatabaseIndex);
    safe_free(response->userId);
    safe_free(response->validityCount);
    safe_free(response->validityTime);
    safe_free(response->orangeCount);
    safe_free(response->orangeTime);
    safe_free(response->securityProfileName);
    safe_free(response->authenticationProtocolName);
    safe_free(response->securityLevel);
    safe_free(response->ILID);
    safe_free(response->ilTypeName);
    safe_free(response->ilAlgorithmName);
    safe_free(response->ilValidityCount);
    safe_free(response->ilValidityTime);
    safe_free(response->authKey2);
    safe_free(response->sessionKey);
    safe_free(response->bindingType);
    free(response);
}

DLL_PUBLIC
void aducid_free_aim_execute_personal_object_response(AducidAIMExecutePersonalObjectResponse *response) {
    if( response == NULL ) { return; }
    safe_free(response->statusMessage);
    aducid_attr_list_free(response->personalObject);
    free(response);
}

/* ADUCID text constants begin */

const static char *aducidOperations[] = {
    "open",
    "init",
    "reinit",
    "change",
    "rechange",
    "delete",
    "replica",
    "link",
    "exuse",
    "autoChange",
    NULL
};

const static char *aducidAttributeSets[] = {
    "Status",
    "Basic",
    "All",
    "Validity",
    "Link",
    "Error",
    "PeigReturnName",
    NULL
};

const static char *aducidAIMStatuses[] = {
    "none",
    "error",
    "working",
    "Client-binding",
    "start",
    "finished",
    "active",
    "internal-error",
    "startTimeout",
    "processTimeout",
    "bindingTimeout",
    "end",
    "passive",
    "Auth-error",
    NULL
};

const static char *aducidMethods[] = {
    "Init",
    "Create",
    "Change",
    "Read",
    "Delete",
    "Write",
    "LegacyLogin",
    "Set",
    "GenKeyPair",
    "WriteCert",
    "LegacySign",
    "OTPverification",
    "ILread",
    "PasswdDecrypt",
    "SetExecuteRight",
    "ClearExecuteRight",
    "UploadCert",
    "TempEnableCAPI",
    "TempDisableCAPI",
    "PermEnableCAPI",
    "PermDisableCAPI",
    "PPOresult",
    "AIMread",
    "ReadPeigCount",
    "ActivateOtherPeigs",
    "DeactivateOtherPeigs",
    "ActivateThePeig",
    "DeactivateThePeig",
    "ReadPeigId",
    "ReadOtherPeigsId",
    "CreateRoomByName",
    "CreateRoomByStory",
    "EnterRoomByName",
    "EnterRoomByStory",
    "ConfirmTransaction",
    "VerifyLF",
    "PeigLocalLink",
    NULL
};

const static char *aducidAlgorithms[] = {
    "USER_ATTRIBUTE_SET",
    "PASSWD",
    "PASSWD-AIM",
    "BIN_STRING",
    "OTP-AIM_1",
    "X509-SIG",
    "PAYMENT",
    NULL
};

const static char *aducidAuthStatuses[] = {
    "OK",
    "ERR",
    "UV",
    "USP",
    "DI",
    "UPR",
    "CR",
    "UI",
    "MI",
    "VI",
    "UIP",
    "USSP",
    "NEO",
    "UOP",
    "NER",
    "IE",
    "NAU",
    "NU",
    "NTD",
    "DR",
    "SPE",
    "NAP",
    "UU",
    "UUS",
    "UTL",
    "UCC",
    "NOP",
    "UIL",
    "ILM",
    "ISE",
    "NSA",
    "KO",
    "PPNP",
    "NS",
    "CTO",
    "LI",
    "DMR",
    "UMR",
    "CMR",
    "MET",
    "BIM",
    "DLN",
    "MCT",
    "BEE",
    "UBM",
    "PCD",
    NULL
};


/* ADUCID text constants end */

const char *aducid_enum_to_str(const int aenum,const char *array[]) {
    int cnt=0;

    while( array[cnt] != NULL ) { cnt++; }
    if( aenum < 1 || aenum > cnt ) { return NULL; }
    return array[aenum - 1];
}

int aducid_str_to_enum(const char *aenum,const char *array[]) {
    int i;

    if(! aenum ) { return 0; }
    for(i=0 ; array[i] != NULL; i++) {
        if( strcasecmp(array[i],aenum) == 0 ) {
            return i+1;
        }
    }
    return 0;
}

DLL_PUBLIC
const char *aducid_operation_str(AducidOperation operation) {
    return aducid_enum_to_str(operation,aducidOperations);
}

DLL_PUBLIC
AducidOperation aducid_operation_enum(char *operation) {
    return (AducidOperation)aducid_str_to_enum(operation,aducidOperations);
}

DLL_PUBLIC
const char *aducid_attribute_set_str(AducidAttributeSet set) {
    return aducid_enum_to_str(set,aducidAttributeSets);
}

DLL_PUBLIC
AducidAttributeSet aducid_attribute_set_enum(char *set) {
    return (AducidAttributeSet)aducid_str_to_enum(set,aducidAttributeSets);
}

DLL_PUBLIC
const char *aducid_aim_status_str(AducidAIMStatus status) {
    return aducid_enum_to_str(status,aducidAIMStatuses);
}

DLL_PUBLIC
AducidAIMStatus aducid_aim_status_enum(char *status) {
    return (AducidAIMStatus)aducid_str_to_enum(status,aducidAIMStatuses);
}

DLL_PUBLIC
const char *aducid_method_str(AducidMethod method) {
    return aducid_enum_to_str(method,aducidMethods);
}

DLL_PUBLIC
AducidMethod aducid_method_enum(char *method) {
    return (AducidMethod)aducid_str_to_enum(method,aducidMethods);
}

DLL_PUBLIC
const char *aducid_algorithm_str(AducidAlgorithm alg) {
    return aducid_enum_to_str(alg,aducidAlgorithms);
}

DLL_PUBLIC
AducidAlgorithm aducid_algorithm_enum(char *alg) {
    return (AducidAlgorithm)aducid_str_to_enum(alg,aducidAlgorithms);
}

DLL_PUBLIC
const char *aducid_auth_status_str(AducidAuthStatus status) {
    return aducid_enum_to_str(status,aducidAuthStatuses);
}

DLL_PUBLIC
AducidAuthStatus aducid_auth_status_enum(char *status) {
    return (AducidAuthStatus)aducid_str_to_enum(status,aducidAuthStatuses);
}

DLL_PUBLIC
AducidAIMRequestOperationResponse *aducid_aim_request_operation(const char *R4,
                                                                AducidOperation operation,
                                                                const char *AIMName,
                                                                const char *authId,
                                                                const char *bindingKey,
                                                                const char *methodName,
                                                                const char *methodParameter,
                                                                const char *personalObject,
                                                                const char *AAIM2,
                                                                const char *ilData,
                                                                const char *peigReturnName)
{
    char *XML;
    char *dom,*p;
    AducidAIMRequestOperationResponse *result;
    
    XML = create_aim_request_operation_xml(
                                           aducid_operation_str(operation),
                                           AIMName,authId,bindingKey, methodName, methodParameter,
                                           personalObject,AAIM2,ilData,
                                           peigReturnName
                                           );
    dom = soap_request(R4,"AIMrequestOperation",XML);

