thalman/c-aducid/src/aducid.c
    /* dom = xmlParseDoc(BAD_CAST response); */
    result = NULL;
    if(dom != NULL) {
        result = (AducidAIMRequestOperationResponse *)malloc( sizeof(AducidAIMRequestOperationResponse) );
        result->authId = xml_get_single_node_text(dom, "//authId");
        result->bindingId = xml_get_single_node_text(dom, "//bindingId");
        result->bindingKey = xml_get_single_node_text(dom, "//bindingKey");
        p = xml_get_single_node_text(dom, "//statusAIM");
        result->statusAIM = aducid_aim_status_enum( p );
        safe_free(p);
        p = xml_get_single_node_text(dom, "//statusAuth");
        result->statusAuth = aducid_auth_status_enum( p );
        safe_free(p);
    }
    safe_free(XML);
    safe_free(dom);
    
    return result;
}

DLL_PUBLIC
AducidAIMGetPSLAttributesResponse *aducid_aim_get_psl_attributes(const char *R4,
                                                                 const char *authId,
                                                                 const char *bindingId,
                                                                 const char *AIMName,
                                                                 const char *authKey,
                                                                 AducidAttributeSet attributeSet) {
    char *XML;
    char *dom, *p;
    AducidAIMGetPSLAttributesResponse *result;
    
    /**
       #<xs:element name="authId" type="authidType" minOccurs="0" maxOccurs="1"/>
       #<xs:element name="AIMname" type="nameType" minOccurs="0" maxOccurs="1"/>
       #<xs:element name="authKey" type="authkeyType" minOccurs="0" maxOccurs="1"/>
       #<xs:element name="attributeSetName" type="nameType" minOccurs="0" maxOccurs="1"/>
    */
    XML = create_aim_get_psl_attributes_xml(authId, bindingId, AIMName, authKey, aducid_attribute_set_str( attributeSet ) );
    dom = soap_request(R4,"AIMgetPSLAttributes",XML);
    
    /* dom = xmlParseDoc(response); */
    result = NULL;
    if( dom ) {
        result = (AducidAIMGetPSLAttributesResponse *)malloc( sizeof(AducidAIMGetPSLAttributesResponse) );
        memset(result,0,sizeof(AducidAIMGetPSLAttributesResponse));

        p = xml_get_single_node_text(dom,"//statusAIM");
        result->statusAIM = aducid_aim_status_enum( p );
        safe_free(p);

        p =  xml_get_single_node_text(dom,"//statusAuth");
        result->statusAuth = aducid_auth_status_enum( p );
        safe_free(p);

        p = xml_get_single_node_text(dom,"//operationName");
	result->operationName = aducid_operation_enum( p );
        safe_free(p);
    
	result->userDatabaseIndex = xml_get_single_node_text(dom, "//userDatabaseIndex");
        result->userId = xml_get_single_node_text(dom,"//userId");

	result->validityCount = xml_get_single_node_text(dom,"//validityCount");
        result->validityTime = xml_get_single_node_text(dom,"//validityTime");
        result->orangeCount = xml_get_single_node_text(dom,"//orangeCount");
	result->orangeTime = xml_get_single_node_text(dom,"//orangeTime");

	result->securityProfileName = xml_get_single_node_text(dom,"//securityProfileName");
        result->authenticationProtocolName = xml_get_single_node_text(dom,"//authenticationProtocolName");
	result->securityLevel = xml_get_single_node_text(dom,"//securityLevel");
    
        result->ILID = xml_get_single_node_text(dom,"//ilid");
        result->ilTypeName = xml_get_single_node_text(dom,"//ilTypeName");
        result->ilAlgorithmName = xml_get_single_node_text(dom,"//ilAlgorithmName");
	result->ilValidityTime = xml_get_single_node_text(dom,"//ilValidityTime");
        result->ilValidityCount = xml_get_single_node_text(dom,"//ilValidityCount");

	result->authKey2 = xml_get_single_node_text(dom,"//authKey2");
        result->sessionKey = xml_get_single_node_text(dom,"//sessionKey");

        result->bindingType = xml_get_single_node_text(dom,"//bindingType");
    }
    safe_free(XML);
    safe_free(dom);

    return result;
}


DLL_PUBLIC
AducidAIMExecutePersonalObjectResponse *aducid_aim_execute_personal_object(
    const char *R4,
    const char *authId,
    const char *AIMName,
    const char *authKey,
    AducidMethod methodName,
    const char *personalObjectName,
    AducidAlgorithm personalObjectAlgorithm,
    AducidAttributeList *personalObjectData,
    const char *ILID, const char *AAIM2, const char *ilData
                                                                           ) {
    char *XML;
    char *dom;
    char *p;
    AducidAIMExecutePersonalObjectResponse *result;
    /**
       #<xs:element name="authId" type="authidType" minOccurs="0" maxOccurs="1"/>
       #<xs:element name="AIMname" type="nameType" minOccurs="0" maxOccurs="1"/>
       #<xs:element name="authKey" type="authkeyType" minOccurs="0" maxOccurs="1"/>
       #<xs:element name="methodName" type="nameType" minOccurs="0" maxOccurs="1"/>
       #<xs:element name="personalObject" type="personalObjectType" minOccurs="0" maxOccurs="1"/>..
       #<xs:element name="ILID" type="ILIDType" minOccurs="0" maxOccurs="1"/>
       #<xs:element name="AAIM2" type="aimUrlType" minOccurs="0" maxOccurs="1"/>
       #<xs:element name="ilData" type="ildataType" minOccurs="0" maxOccurs="1"/>
    */
    XML = create_aim_execute_personal_object_xml(authId, AIMName, authKey,
                                                 aducid_method_str( methodName ),
                                                 personalObjectName,
                                                 aducid_algorithm_str(personalObjectAlgorithm),
                                                 personalObjectData,ILID,AAIM2,ilData);
    dom = soap_request(R4,"AIMexecutePersonalObject",XML);
    result = (AducidAIMExecutePersonalObjectResponse *)malloc( sizeof(AducidAIMExecutePersonalObjectResponse) );
    memset(result,0,sizeof(AducidAIMExecutePersonalObjectResponse) );

    p = xml_get_single_node_text(dom,"//statusAIM");
    result->statusAIM = aducid_aim_status_enum( p );
    safe_free(p);
    
