thalman/c-aducid/src/aducid.c
    p = xml_get_single_node_text(dom,"//statusAuth");
    result->statusAuth = aducid_auth_status_enum( p );
    safe_free(p);
    
    result->personalObject = parse_personal_object(dom);
    free(XML);
    free(dom);
    return result;
}

DLL_PUBLIC
bool aducid_aim_close_session(const char *R4, const char *authId, const char *AIMName, const char *authKey) {
    /**
       function callCloseSession($R4URL,$request) {
       $soap = new SoapClient(NULL,
       array ( "location" => $R4URL,
       "uri"      => "http://iface.aducid.anect.com",
       "style"    => SOAP_RPC,
       "use"      => SOAP_ENCODED
       ));
       $soapParams = array();
       if( isset($request["authId"])  && ( $request["authId"] != NULL )  ) { array_push($soapParams, new SoapParam($request["authId"],"authId") ); }
       if( isset($request["AIMName"]) && ( $request["AIMName"] != NULL ) ) { array_push($soapParams, new SoapParam($request["AIMName"],"AIMName") ); }
       if( isset($request["authKey"]) && ( $request["authKey"] != NULL ) ) { array_push($soapParams, new SoapParam($request["authKey"],"authKey") ); }
       $result = $soap->__call(
       "AIMcloseSession",
       $soapParams
       );
       return $result;
       }
    */
    char *XML;
    char *dom;
    char *status;
    AducidAIMStatus AIMStatus;
    AducidAuthStatus AuthStatus;
    
    XML = create_aim_close_session_xml(authId, AIMName, authKey);
    dom = soap_request(R4,"AIMcloseSession",XML);

    status = xml_get_single_node_text(dom,"//statusAIM");
    AIMStatus = aducid_aim_status_enum( status );
    safe_free(status);

    status = xml_get_single_node_text(dom,"//statusAuth");
    AuthStatus = aducid_auth_status_enum( status );
    safe_free(status);

    /**
       <?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"><soapenv:Body><ns1:AIMcloseSessionResponse xmlns:ns1=\"http://iface.aducid.anect.com\"><statusAIM>end</statusAIM><statusAuth>OK</statusAuth></ns1:AIMcloseSessionResponse></soapenv:Body></soapenv:Envelope>"
    */
    free(XML);
    free(dom);
    return (AuthStatus == ADUCID_AUTHSTATUS_OK) && ( AIMStatus == ADUCID_AIM_STATUS_END );
}


DLL_PUBLIC
AducidHandle aducid_new(const char *AIM, const char *authId, const char *authKey, const char *bindingId, const char *bindingKey) {
    AducidHandle handle;
    char *r3 = NULL;
    char *r4 = NULL;
    
    if( AIM == NULL ) { return NULL; }
    handle = (AducidHandleStruct *)malloc( sizeof(AducidHandleStruct) );
    if(!handle) { return NULL; }
    memset(handle,0,sizeof(AducidHandleStruct) );
    /* AIM can be aim.example.com 10.0.0.1 http[s]://aim.example.com:8080 */
    if( (strncasecmp(AIM,"http://",7) != 0 ) && (strncasecmp(AIM,"https://",8) != 0) ) {
        /* protocol missing */
        r3 = dyn_strcat(r3,"http://",false);
    }
    r3 = dyn_strcat(r3,strdup(AIM),true);
    if( (strlen(r3) > 0) && (r3[strlen(r3)-1] != '/' ) ) {
        /* add trailing slash */
        r3 = dyn_strcat(r3,"/",false);
    }
    r4 = strdup(r3);
    handle->R3 = dyn_strcat(r3,"AIM/services/R3",false);
    handle->R4 = dyn_strcat(r4,"AIM/services/R4",false);
    if(authId) {
        handle->authId = strdup(authId);
        if(authKey) { handle->authKey = strdup(authKey); }
        if(bindingId) { handle->bindingId = strdup(bindingId); }
        if(bindingKey) { handle->bindingKey = strdup(bindingKey); }
    }
    return handle;
}

DLL_PUBLIC
void aducid_set_authid(AducidHandle handle, const char *authId) {
    if(!handle) return;
    
    safe_free(handle->authId);
    if(authId) {
        handle->authId = strdup(authId);
    } else {
        handle->authId = NULL;
    }
}

DLL_PUBLIC
const char *aducid_get_authid(AducidHandle handle) {
    if(!handle) return NULL;
    return handle->authId;
}

DLL_PUBLIC
void aducid_set_authkey(AducidHandle handle, const char *authKey) {
    if(!handle) return;
    
    safe_free(handle->authKey);
    if(authKey) {
        handle->authKey = strdup(authKey);
    } else {
        handle->authKey = NULL;
    }
}

DLL_PUBLIC
const char *aducid_get_authkey(AducidHandle handle) {
    if(!handle) return NULL;
    return handle->authKey;
}

DLL_PUBLIC
void aducid_set_bindingkey(AducidHandle handle, const char *bindingKey) {
    if(!handle) return;
    
    safe_free(handle->bindingKey);
    if(bindingKey) {
        handle->bindingKey = strdup(bindingKey);
    } else {
        handle->bindingKey = NULL;
    }
}

DLL_PUBLIC
const char *aducid_get_bindingkey(AducidHandle handle) {
    if(!handle) return NULL;
    return handle->bindingKey;
}

DLL_PUBLIC
void aducid_set_bindingid(AducidHandle handle, const char *bindingId) {
    if(!handle) return;
    
    safe_free(handle->bindingId);
    if(bindingId) {
        handle->bindingId = strdup(bindingId);
    } else {
        handle->bindingId = NULL;
    }
}

DLL_PUBLIC
const char *aducid_get_bindingid(AducidHandle handle) {
    if(!handle) return NULL;
    return handle->bindingId;
}

DLL_PUBLIC
const char *aducid_request_operation(AducidHandle handle,
                               AducidOperation operation,
                               const char* methodName,
                               const char* methodParameter,
                               const char *personalObject,
                               const char *AAIM2,
                               const char *ilData,
                               const char *peigReturnName) {
    AducidAIMRequestOperationResponse *response;

    if(!handle)return NULL;
    if( handle->authId == NULL ) {
        safe_free(handle->authKey);
        safe_free(handle->bindingId);
        safe_free(handle->bindingKey);
        handle->authKey = NULL;
        handle->bindingKey = NULL;
        handle->bindingId = NULL;
    }
    response = aducid_aim_request_operation(handle->R4,
                                            operation,
                                            handle->AIMName,
                                            handle->authId,
                                            handle->bindingKey,
                                            methodName, methodParameter,
                                            personalObject,AAIM2,ilData,
                                            peigReturnName);
    if( response && (response->authId) ) {
        if( handle->authId == NULL ) {
            handle->authId = response->authId;
            response->authId = NULL;
        }
        handle->bindingId = response->bindingId;
        handle->bindingKey = response->bindingKey;
        response->bindingId = NULL;
        response->bindingKey = NULL;
    }
    aducid_free_aim_request_operation_response(response);
    return handle->authId;
}

DLL_PUBLIC
const char *aducid_open(AducidHandle handle, const char *peigReturnName) {
    return aducid_request_operation(handle,ADUCID_OPERATION_OPEN,NULL,NULL,NULL,NULL,NULL,peigReturnName);
}

DLL_PUBLIC
const char *aducid_init(AducidHandle handle, const char *peigReturnName) {
    return aducid_request_operation(handle,ADUCID_OPERATION_INIT,NULL,NULL,NULL,NULL,NULL,peigReturnName);
}

DLL_PUBLIC
const char *aducid_reinit(AducidHandle handle, const char *peigReturnName) {
    return aducid_request_operation(handle,ADUCID_OPERATION_REINIT,NULL,NULL,NULL,NULL,NULL,peigReturnName);
}

DLL_PUBLIC
const char *aducid_change(AducidHandle handle, const char *peigReturnName) {
    return aducid_request_operation(handle,ADUCID_OPERATION_CHANGE,NULL,NULL,NULL,NULL,NULL,peigReturnName);
}

DLL_PUBLIC
const char *aducid_rechange(AducidHandle handle, const char *peigReturnName) {
    return aducid_request_operation(handle,ADUCID_OPERATION_RECHANGE,NULL,NULL,NULL,NULL,NULL,peigReturnName);
}

DLL_PUBLIC
const char *aducid_delete(AducidHandle handle, const char *peigReturnName) {
    return aducid_request_operation(handle,ADUCID_OPERATION_DELETE,NULL,NULL,NULL,NULL,NULL,peigReturnName);
}

DLL_PUBLIC
bool aducid_close(AducidHandle handle) {
    return aducid_aim_close_session(handle->R4,handle->authId,handle->AIMName,handle->authKey);
}

DLL_PUBLIC
AducidAIMGetPSLAttributesResponse *aducid_get_psl_attributes(AducidHandle handle,AducidAttributeSet attributeSet, bool useCache){
    if(!handle || !handle->authId) return false;
    if(attributeSet <= ADUCID_ATTRIBUTE_SET_INVALID || attributeSet > ADUCID_ATTRIBUTE_SET_ERROR ) return false;
    if( ! useCache && handle->PSLCache[attributeSet-1] ) {
        aducid_free_aim_get_psl_attributes_response(handle->PSLCache[attributeSet-1]);
        handle->PSLCache[attributeSet-1] = NULL;
    }
    if( handle->PSLCache[attributeSet-1] != NULL ) {
        return handle->PSLCache[attributeSet-1];
    }
    handle->PSLCache[attributeSet-1] = aducid_aim_get_psl_attributes(handle->R4,handle->authId,handle->bindingId,NULL,handle->authKey,attributeSet);
    if( handle->PSLCache[attributeSet-1] && handle->PSLCache[attributeSet-1]->authKey2) {
        aducid_set_authkey(handle,handle->PSLCache[attributeSet-1]->authKey2);
    }
    return handle->PSLCache[attributeSet-1];    
}

DLL_PUBLIC
bool aducid_wait_for_operation(AducidHandle handle) {
    AducidAIMGetPSLAttributesResponse *status;
    
