thalman/c-aducid/src/aducid.c
    if(!handle) return false;
    if(!handle->authId) return false;
    
    while(true) {
        status = aducid_get_psl_attributes(handle,ADUCID_ATTRIBUTE_SET_STATUS,false);
        if( (status == NULL) || (status->statusAIM == ADUCID_AIM_STATUS_INVALID) ) {
            /* unexpected error */
            return false;
        }
        if( (status->statusAIM == ADUCID_AIM_STATUS_START) || (status->statusAIM == ADUCID_AIM_STATUS_WORKING) ) {
            sleep(1);
        } else {
            return true;
        }
    }
}

DLL_PUBLIC
bool aducid_verify(AducidHandle handle) {
    AducidAIMGetPSLAttributesResponse *status;
    if(!handle) return false;
    
    status = aducid_get_psl_attributes(handle,ADUCID_ATTRIBUTE_SET_ALL,true);
    if(!status) return false;
    return (status->statusAuth == ADUCID_AUTHSTATUS_OK) && (status->statusAIM == ADUCID_AIM_STATUS_ACTIVE);
}

DLL_PUBLIC
AducidAttributeList *aducid_get_attributes(AducidHandle handle,char *attrSetName) {
    AducidAttributeList *list = NULL;
    AducidAIMExecutePersonalObjectResponse *dpo;
    
    if(!handle || !handle->authId || !handle->authKey ) return NULL;
    if( attrSetName == NULL ) { attrSetName = "default"; }
    dpo = aducid_aim_execute_personal_object(handle->R4,
                                             handle->authId,
                                             NULL,
                                             handle->authKey,
                                             ADUCID_METHOD_READ,
                                             attrSetName,
                                             ADUCID_ALGORITHM_USER_ATTR_SET,
                                             NULL,NULL,NULL,NULL);
    if(dpo && dpo->personalObject ) {
        list = dpo->personalObject;
        dpo->personalObject = NULL;
    }
    aducid_free_aim_execute_personal_object_response(dpo);
    return list;
}

DLL_PUBLIC
bool aducid_set_attributes(AducidHandle handle, char *attrSetName, AducidAttributeList *attrs) {
    AducidAIMExecutePersonalObjectResponse *dpo;
    
    if(!handle || !handle->authId || !handle->authKey ) return false;
    if( attrSetName == NULL ) { attrSetName = "default"; }
    dpo = aducid_aim_execute_personal_object(handle->R4,
                                             handle->authId,
                                             NULL,
                                             handle->authKey,
                                             ADUCID_METHOD_WRITE,
                                             attrSetName,
                                             ADUCID_ALGORITHM_USER_ATTR_SET,
                                             attrs,NULL,NULL,NULL);
    /* FIXME: check statusAIM/statusAuth */
    aducid_free_aim_execute_personal_object_response(dpo);
    return true;
}

DLL_PUBLIC
const char *aducid_get_user_database_index(AducidHandle handle) {
    AducidAIMGetPSLAttributesResponse *response;
    
    if( !handle || !handle->authId || !handle->authKey ) return NULL;
    response = aducid_get_psl_attributes(handle,ADUCID_ATTRIBUTE_SET_ALL,true);
    return response->userDatabaseIndex;
}

DLL_PUBLIC
void aducid_clear_psl_cache(AducidHandle handle) {
    if(handle) {
        int i;

        for( i=0; i < ADUCID_ATTRIBUTE_SET_ERROR; i++) {
            aducid_free_aim_get_psl_attributes_response(handle->PSLCache[i]);
        }
    }
}

DLL_PUBLIC
void aducid_free(AducidHandle handle) {
    if(handle) {
        safe_free(handle->authId);
        safe_free(handle->authKey);
        safe_free(handle->AIMName);
        safe_free(handle->R3);
        safe_free(handle->R4);
        aducid_clear_psl_cache(handle);
    }
    safe_free(handle);
}

/*
  DLL_PUBLIC AducidClient::AducidClient(char *aim) {
  handle = aducid_new(aim);
  }
  DLL_PUBLIC AducidClient::~AducidClient() {
  aducid_free(handle);
  }
  DLL_PUBLIC char *AducidClient::open() {
  return aducid_open(handle);
  }
  DLL_PUBLIC char *AducidClient::init() {
  return aducid_init(handle);
  }
  DLL_PUBLIC char *AducidClient::reinit() {
  return aducid_reinit(handle);
  }
  DLL_PUBLIC char *AducidClient::change() {
  return aducid_change(handle);
  }
  DLL_PUBLIC char *AducidClient::rechange() {
  return aducid_rechange(handle);
  }
  DLL_PUBLIC bool AducidClient::close() {
  return aducid_close(handle);
  }
  DLL_PUBLIC AIMGetPSLAttributesResponse *AducidClient::getPslAttributes(AducidAttributeSet attributeSet, bool useCache) {
  return aducid_get_psl_attributes(handle,attributeSet,useCache);
  }
*/

DLL_PUBLIC
int aducid_library_init() {
#if defined(_WIN32) || defined(_W64)
    return 0;
#else
    return curl_global_init(CURL_GLOBAL_ALL);
#endif
}

DLL_PUBLIC
int aducid_library_free() {
#if defined(_WIN32) || defined(_W64)
    return 0;
#else
    curl_global_cleanup();
    return 0;
#endif
}
